In [147]:
import numpy as np
import pandas as pd

In [148]:
movie = pd.read_csv('dataset/hollywood/tmdb_5000_movies.csv')
credits = pd.read_csv('dataset/hollywood/tmdb_5000_credits.csv')
movie_boll = pd.read_csv('dataset/bollywood/IMDB-Movie-Dataset(2023-1951).csv')

In [149]:
import ast
# Convert stringified list of dicts to list of names
def convert(obj):
    L=[]
    for i in ast.literal_eval(obj):
        L.append(i['name'])
    return L

# Get top 3 cast members
def convert3(obj):
    L=[]
    counter=0
    for i in ast.literal_eval(obj):
        if counter!=3:
            L.append(i['name'])
            counter+=1
        else:
            break
    return L

# Extract director name
def fetch_director(obj):
    L=[]
    for i in ast.literal_eval(obj):
        if i['job']=='Director':
            L.append(i['name'])
            break
    return L

# Remove spaces in names and make lists
def clean_column(x):
    if isinstance(x, str):
        return [i.replace(" ", "").lower() for i in x.split(",")]
    return []

# Holywood dataset

In [150]:
display(movie.columns)
display(movie.head(1))

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

In [151]:
display(credits.columns)
display(credits.head(1))

Index(['movie_id', 'title', 'cast', 'crew'], dtype='object')

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [152]:
movie_holl = movie.merge(credits, on='title')
movie_holl = movie_holl[['movie_id', 'title', 'overview', 'genres', 'keywords', 'cast', 'crew']]
movie_holl.dropna(inplace=True)

In [153]:
display(movie_holl.head(2))

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"In the 22nd century, a paraplegic Marine is di...","[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...","[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...","[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...","[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."

In [154]:
# Apply conversions
movie_holl['genres'] = movie_holl['genres'].apply(convert)
movie_holl['keywords'] = movie_holl['keywords'].apply(convert)
movie_holl['cast'] = movie_holl['cast'].apply(convert3)
movie_holl['crew'] = movie_holl['crew'].apply(fetch_director)

In [155]:
display(movie_holl.head(2))

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"In the 22nd century, a paraplegic Marine is di...","[Action, Adventure, Fantasy, Science Fiction]","[culture clash, future, space war, space colon...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]",[James Cameron]
1,285,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...","[Adventure, Fantasy, Action]","[ocean, drug abuse, exotic island, east india ...","[Johnny Depp, Orlando Bloom, Keira Knightley]",[Gore Verbinski]

In [156]:
# Process overview and remove spaces from names
movie_holl['overview'] = movie_holl['overview'].apply(lambda x: x.split())
for col in ['genres', 'keywords', 'crew',]:
    movie_holl[col] = movie_holl[col].apply(lambda x: [i.replace(" ", "") for i in x])

movie_holl['cast_new'] = movie_holl['cast'].apply(lambda x: [i.replace(" ", "") for i in x])

In [157]:
display(movie_holl.head(2))

,movie_id,title,overview,genres,keywords,cast,crew,cast_new
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin...","[Action, Adventure, Fantasy, ScienceFiction]","[cultureclash, future, spacewar, spacecolony, ...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]",[JamesCameron],"[SamWorthington, ZoeSaldana, SigourneyWeaver]"
1,285,Pirates of the Caribbean: At World's End,"[Captain, Barbossa,, long, believed, to, be, d...","[Adventure, Fantasy, Action]","[ocean, drugabuse, exoticisland, eastindiatrad...","[Johnny Depp, Orlando Bloom, Keira Knightley]",[GoreVerbinski],"[JohnnyDepp, OrlandoBloom, KeiraKnightley]"

In [158]:

movie_holl['tags'] = movie_holl['overview'] + movie_holl['genres'] + movie_holl['keywords'] + movie_holl['cast_new'] + movie_holl['crew']

In [159]:
movie_holl = movie_holl[['movie_id','title','cast','genres','tags' ]]

In [160]:
display(movie_holl.head(2))

,movie_id,title,cast,genres,tags
0,19995,Avatar,"[Sam Worthington, Zoe Saldana, Sigourney Weaver]","[Action, Adventure, Fantasy, ScienceFiction]","[In, the, 22nd, century,, a, paraplegic, Marin..."
1,285,Pirates of the Caribbean: At World's End,"[Johnny Depp, Orlando Bloom, Keira Knightley]","[Adventure, Fantasy, Action]","[Captain, Barbossa,, long, believed, to, be, d..."

# Bollywood Dataset

In [161]:
display(movie_boll.columns)
display(movie_boll.head(2))

Index(['Unnamed: 0', 'movie_id', 'movie_name', 'year', 'genre', 'overview',
       'director', 'cast'],
      dtype='object')

,Unnamed: 0,movie_id,movie_name,year,genre,overview,director,cast
0,0,tt15354916,Jawan,2023,"Action, Thriller",A high-octane action thriller which outlines t...,Atlee,"Shah Rukh Khan, Nayanthara, Vijay Sethupathi, ..."
1,1,tt15748830,Jaane Jaan,2023,"Crime, Drama, Mystery",A single mother and her daughter who commit a ...,Sujoy Ghosh,"Kareena Kapoor, Jaideep Ahlawat, Vijay Varma, ..."

In [162]:
movie_boll = movie_boll[['movie_id', 'movie_name', 'overview', 'genre', 'cast', 'director']]
movie_boll.dropna(inplace=True)

In [163]:
display(movie_boll.head(2))

,movie_id,movie_name,overview,genre,cast,director
0,tt15354916,Jawan,A high-octane action thriller which outlines t...,"Action, Thriller","Shah Rukh Khan, Nayanthara, Vijay Sethupathi, ...",Atlee
1,tt15748830,Jaane Jaan,A single mother and her daughter who commit a ...,"Crime, Drama, Mystery","Kareena Kapoor, Jaideep Ahlawat, Vijay Varma, ...",Sujoy Ghosh

In [164]:
movie_boll['overview'] = movie_boll['overview'].apply(lambda x: x.split() if isinstance(x, str) else [])
for col in ['genre', 'director']:
    movie_boll[col] = movie_boll[col].apply(clean_column)
movie_boll['cast_new'] = movie_boll['cast'].apply(clean_column)

In [165]:
display(movie_boll.head(2))

,movie_id,movie_name,overview,genre,cast,director,cast_new
0,tt15354916,Jawan,"[A, high-octane, action, thriller, which, outl...","[action, thriller]","Shah Rukh Khan, Nayanthara, Vijay Sethupathi, ...",[atlee],"[shahrukhkhan, nayanthara, vijaysethupathi, de..."
1,tt15748830,Jaane Jaan,"[A, single, mother, and, her, daughter, who, c...","[crime, drama, mystery]","Kareena Kapoor, Jaideep Ahlawat, Vijay Varma, ...",[sujoyghosh],"[kareenakapoor, jaideepahlawat, vijayvarma, sa..."

In [166]:
movie_boll['tags'] =  movie_boll['overview'] + movie_boll['genre']*2 + movie_boll['cast_new'] + movie_boll['director']

In [167]:
movie_boll = movie_boll[['movie_id','movie_name','cast','genre','tags']]

In [173]:
movie_boll.rename(columns={
    'movie_name': 'title',
    'genre': 'genres'
}, inplace=True)

In [174]:
display(movie_boll.head(2))

,movie_id,title,cast,genres,tags
0,tt15354916,Jawan,"Shah Rukh Khan, Nayanthara, Vijay Sethupathi, ...","[action, thriller]","[A, high-octane, action, thriller, which, outl..."
1,tt15748830,Jaane Jaan,"Kareena Kapoor, Jaideep Ahlawat, Vijay Varma, ...","[crime, drama, mystery]","[A, single, mother, and, her, daughter, who, c..."

In [170]:
display(movie_holl.head(2))

,movie_id,title,cast,genres,tags
0,19995,Avatar,"[Sam Worthington, Zoe Saldana, Sigourney Weaver]","[Action, Adventure, Fantasy, ScienceFiction]","[In, the, 22nd, century,, a, paraplegic, Marin..."
1,285,Pirates of the Caribbean: At World's End,"[Johnny Depp, Orlando Bloom, Keira Knightley]","[Adventure, Fantasy, Action]","[Captain, Barbossa,, long, believed, to, be, d..."

In [171]:
movie_holl['cast'] = movie_holl['cast'].apply(lambda lst: ", ".join(lst))
display(movie_holl.head(2))

,movie_id,title,cast,genres,tags
0,19995,Avatar,"Sam Worthington, Zoe Saldana, Sigourney Weaver","[Action, Adventure, Fantasy, ScienceFiction]","[In, the, 22nd, century,, a, paraplegic, Marin..."
1,285,Pirates of the Caribbean: At World's End,"Johnny Depp, Orlando Bloom, Keira Knightley","[Adventure, Fantasy, Action]","[Captain, Barbossa,, long, believed, to, be, d..."

In [175]:
movie_boll.to_csv('dataset/cleaned/bollywood_cleaned.csv', index=False)
movie_holl.to_csv('dataset/cleaned/hollywood_cleaned.csv', index=False)